Reports/КонтрольНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>КонтрольНоменклатуры</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НоменклатураПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПодразделений</Name>
			<Comment>Доступна ли номенклатура для подразделения</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗакупОптом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЛистов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяПоСкладу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/КонтрольНоменклатуры/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Ключ = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		
		СтандартнаяОбработка = Ложь;
		фнПараметры = Новый Структура;
		фнПараметры.Вставить("Ключ", Ключ);
		ОткрытьФорму("РегистрСведений.НоменклатураПодразделений.ФормаЗаписи", фнПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(фнРасшифровка)
	
	Перем Номенклатура, Подразделение, Ключ;
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементыРасшифровки = Данные.Элементы.Получить(фнРасшифровка);
	Поля = ЭлементыРасшифровки.ПолучитьПоля();
	
	Если Поля.Количество() = 1 Тогда
		Поле = Поля[0].Поле;
	КонецЕсли;
	
	Если Поле = "Номенклатура" Тогда
		
		МассивРодители = ЭлементыРасшифровки.ПолучитьРодителей();
		Если МассивРодители.Количество() = 1 Тогда
			ПолеРодителя = Данные.Элементы.Получить(МассивРодители[0].Идентификатор).ПолучитьПоля();
			Номенклатура = ПолеРодителя[0].Значение;
		КонецЕсли;
		
		НастройкаПодразделение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0];
		
		Если НастройкаПодразделение <> Неопределено Тогда
			Подразделение = НастройкаПодразделение.Значение;
		КонецЕсли;
		
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			И ЗначениеЗаполнено(Номенклатура)
			И НЕ Номенклатура.ЭтоГруппа
			И ТипЗнч(Подразделение) = Тип("СправочникСсылка.Подразделения")
			И ЗначениеЗаполнено(Подразделение) Тогда
			
			ЗначениеКлюча = Новый Структура;
			ЗначениеКлюча.Вставить("Номенклатура", Номенклатура);
			ЗначениеКлюча.Вставить("Подразделение", Подразделение);
			Ключ = РегистрыСведений.НоменклатураПодразделений.СоздатьКлючЗаписи(ЗначениеКлюча);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ключ;
	
КонецФункции
